[NoCoverage] BlockStatement
src/orders/order.controller.ts:9:66
   constructor(private readonly orderService: OrderService) {}
 
   @Post()
-  async create(@Body() body: { userId: string; amount: number }) {
-    return this.orderService.createOrder(body.userId, body.amount);
-  }
+  async create(@Body() body: { userId: string; amount: number }) {}
 
   @Get()

[NoCoverage] BlockStatement
src/orders/order.controller.ts:14:13
   }
 
   @Get()
-  findAll() {
-    return this.orderService.getOrders();
-  }
+  findAll() {}
 
   @Get(':id')

[NoCoverage] BlockStatement
src/orders/order.controller.ts:19:36
   }
 
   @Get(':id')
-  findOne(@Param('id') id: string) {
-    return this.orderService.getOrderById(id);
-  }
+  findOne(@Param('id') id: string) {}
 }
