[Killed] ArrayDeclaration
src/orders/order.service.ts:7:29
 
 @Injectable()
 export class OrderService {
-  private orders: Order[] = [];
+  private orders: Order[] = ["Stryker was here"];
 
   async createOrder(userId: string, amount: number): Promise<Order> {
killedBy: OrderService should get all orders
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
src/orders/order.service.ts:9:69
 export class OrderService {
   private orders: Order[] = [];
 
-  async createOrder(userId: string, amount: number): Promise<Order> {
-    const id = Date.now().toString();
-    const order: Order = { id, userId, amount, status: 'PENDING' };
-    this.orders.push(order);
-
-    try {
-      const response = await axios.post('http://payments-ms:3001/payments', { orderId: id, amount });
-      if (response.data.status === 'APPROVED') {
-        order.status = 'PAID';
-      } else {
-        order.status = 'FAILED';
-      }
-    } catch (error) {
-      order.status = 'FAILED';
-    }
-
-    return order;
-  }
+  async createOrder(userId: string, amount: number): Promise<Order> {}
 
   getOrders(): Order[] {
killedBy: OrderService should create order and set status to PAID if approved
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/orders/order.service.ts:14:9
     const order: Order = { id, userId, amount, status: 'PENDING' };
     this.orders.push(order);
 
-    try {
-      const response = await axios.post('http://payments-ms:3001/payments', { orderId: id, amount });
-      if (response.data.status === 'APPROVED') {
-        order.status = 'PAID';
-      } else {
-        order.status = 'FAILED';
-      }
-    } catch (error) {
+    try {} catch (error) {
       order.status = 'FAILED';
     }
killedBy: OrderService should create order and set status to PAID if approved
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PAID"
Received: "PENDING"

[Killed] ObjectLiteral
src/orders/order.service.ts:15:77
     this.orders.push(order);
 
     try {
-      const response = await axios.post('http://payments-ms:3001/payments', { orderId: id, amount });
+      const response = await axios.post('http://payments-ms:3001/payments', {});
       if (response.data.status === 'APPROVED') {
         order.status = 'PAID';
killedBy: OrderService should create order and set status to PAID if approved
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://payments-ms:3001/payments",
- Object {
-   "amount": 100,

[Killed] ConditionalExpression
src/orders/order.service.ts:16:11
 
     try {
       const response = await axios.post('http://payments-ms:3001/payments', { orderId: id, amount });
-      if (response.data.status === 'APPROVED') {
+      if (true) {
         order.status = 'PAID';
       } else {
killedBy: OrderService should create order and set status to FAILED if declined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAILED"
Received: "PAID"

[Killed] EqualityOperator
src/orders/order.service.ts:16:11
 
     try {
       const response = await axios.post('http://payments-ms:3001/payments', { orderId: id, amount });
-      if (response.data.status === 'APPROVED') {
+      if (response.data.status !== 'APPROVED') {
         order.status = 'PAID';
       } else {
killedBy: OrderService should create order and set status to PAID if approved
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PAID"
Received: "FAILED"

[Killed] BlockStatement
src/orders/order.service.ts:18:14
       const response = await axios.post('http://payments-ms:3001/payments', { orderId: id, amount });
       if (response.data.status === 'APPROVED') {
         order.status = 'PAID';
-      } else {
-        order.status = 'FAILED';
-      }
+      } else {}
     } catch (error) {
       order.status = 'FAILED';
killedBy: OrderService should create order and set status to FAILED if declined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAILED"
Received: "PENDING"

[Killed] BlockStatement
src/orders/order.service.ts:21:21
       } else {
         order.status = 'FAILED';
       }
-    } catch (error) {
-      order.status = 'FAILED';
-    }
+    } catch (error) {}
 
     return order;
killedBy: OrderService should create order and set status to FAILED on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FAILED"
Received: "PENDING"

[Killed] BlockStatement
src/orders/order.service.ts:28:24
     return order;
   }
 
-  getOrders(): Order[] {
-    return this.orders;
-  }
+  getOrders(): Order[] {}
 
   getOrderById(id: string): Order | undefined {
killedBy: OrderService should create order and set status to PAID if approved
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/orders/order.service.ts:32:47
     return this.orders;
   }
 
-  getOrderById(id: string): Order | undefined {
-    return this.orders.find(o => o.id === id);
-  }
+  getOrderById(id: string): Order | undefined {}
 }
killedBy: OrderService should get order by id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"amount": 100, "id": "1761275138038", "status": "FAILED", "userId": "user1"}
Received: undefined

[Killed] ArrowFunction
src/orders/order.service.ts:33:29
   }
 
   getOrderById(id: string): Order | undefined {
-    return this.orders.find(o => o.id === id);
+    return this.orders.find(() => undefined);
   }
 }
killedBy: OrderService should get order by id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"amount": 100, "id": "1761275138238", "status": "FAILED", "userId": "user1"}
Received: undefined

[Killed] ConditionalExpression
src/orders/order.service.ts:33:34
   }
 
   getOrderById(id: string): Order | undefined {
-    return this.orders.find(o => o.id === id);
+    return this.orders.find(o => true);
   }
 }
killedBy: OrderService should return undefined if order not found
statusReason: Error: expect(received).toBeUndefined()

Received: {"amount": 100, "id": "1761275138291", "status": "FAILED", "userId": "user1"}
